const movies = [
  movieFactory('神力女超人', `上映日期：2017-05-30
    發行商：美商華納兄弟(遠東)股份有限公司台灣分公司
    語言：英語
    片長：141分
    級數：保護級
    導演：派蒂簡金斯 Patty Jenkins
    演員：《蝙蝠俠對超人：正義曙光》蓋兒加朵、《星際爭霸戰》克里斯潘恩`,
    `《神力女超人》是一部於2017年上映的美國超級英雄電影，改編自DC漫畫旗下的同名角色，本片為DC擴展宇宙的第四部作品。由派蒂·珍金斯執導，電影主演包括蓋兒·加朵、克里斯·潘恩、羅蘋·萊特、丹尼·休斯頓、大衛·休利斯、康妮·尼爾森以及伊蓮娜·安娜雅。`, {
      '0531': ['1000', '1100', '1200', '1300'],
      '0601': ['1007', '1120', '1200', '1302'],
      '0602': ['1008', '1145', '1200', '1303'],
      '0603': ['1009', '1150', '1200', '1304'],
      '0604': ['1011', '1100', '1200', '1305']},
    'https://www.in89pier2.com.tw/movie_img/bo2/385/385',
  'https://www.in89pier2.com.tw/movie_img/bo2/385/385_big',
  'https://www.youtube.com/embed/P9SzcEiAf18?rel=0&amp;showinfo=0'),
  movieFactory('老炮兒', `上映日期：2017-06-02
    發行商：香港商甲上娛樂有限公司台灣分公司
    語言：國語
    片長：137分
    級數：輔12級
    導演：管虎
    演員：馮小剛、張涵予、許晴、李易峰、吳亦凡`
    , `★榮獲第52屆金馬獎最佳男主角獎。
    ★兩位金馬獎影帝馮小剛、張涵予飆戲之作。
    ★超人氣偶像吳亦凡、李易峰首度銀幕比拚魅力。
    ★大陸票房超過45億台幣之賣座電影。

    「六爺」張學軍（馮小剛飾）曾是名震北京胡同的硬漢大哥，但時代已逐漸遺忘這位「六爺」與他的兄弟們，由於他兒子(李易峰飾)與飛車黨「三環十二少」譚小飛 (吳亦凡飾)發生衝突並遭到綁架，不做大哥很久的六爺只得重新出馬號召「老」兄弟們助陣，但歲月如刀，刀刀催人老，最後只有好兄弟「悶三兒」(張涵予飾)忠心情義力挺，孤單的六爺決定不拖累老友，一個人領著刀獨自前往頤和園與飛車黨血戰一決高下...`, {
      '0604': ['1000', '1100', '1200', '1300'],
      '0605': ['1007', '1120', '1200', '1300'],
      '0606': ['1008', '1145', '1200', '1300']},
    'https://www.in89pier2.com.tw/movie_img/bo2/401/401',
  'https://www.in89pier2.com.tw/movie_img/bo2/401/401_big',
  'https://www.youtube.com/embed/cI8_ay1E3-k?rel=0&amp;showinfo=0'),
  movieFactory('吃吃的愛', `上映日期：2017-05-27
    發行商：威視股份有限公司
    語言：國語
    片長：91分
    級數：保護級
    導演：蔡康永
    演員：徐熙娣、林志玲、金世佳、李子峰`
    , `＊最後上映日：未定
    ＊本片另有英語字幕供外籍人士觀賞。With English subtitles.

    想要在巨星姐姐面前證明自己的臨時演員上官娣娣，和多年期待真愛卻在最後被狠狠出賣的太空黑鳥麵館老板娘許春梅，當兩個人的世界以想象不到的方式不期而遇，她們的命運會發生什麼樣的改變？`, {
      '0604': ['1000', '1100', '1200', '1300'],
      '0605': ['1007', '1120', '1200', '1300'],
      '0606': ['1008', '1145', '1200', '1300']},
    'https://www.in89pier2.com.tw/movie_img/bo2/399/399',
  'https://www.in89pier2.com.tw/movie_img/bo2/399/399_big',
  'https://www.youtube.com/embed/mdYwHyslpK4?rel=0&amp;showinfo=0'),
  movieFactory('加勒比海盜 神鬼奇航：死無對證', `上映日期：2017-05-24
    發行商：台灣華特迪士尼股份有限公司
    語言：英語
    片長：129分
    級數：保護級
    導演：《康提基號：偉大航程》喬奇姆羅寧、《康提基號：偉大航程》艾斯班山柏格
    演員：《神鬼奇航》強尼戴普、《神鬼奇航》奧蘭多布魯、《007空降危機》哈維爾巴登、《神鬼奇航》傑佛瑞羅許、《移動迷宮》卡雅斯考達里奧、《黑魔女：沉睡魔咒》布蘭頓思懷茲`
    , `＊最後上映日：未定

    位處墨西哥灣與加勒比海的神秘百慕達三角洲，發生過大量令人匪疑所思的失蹤事件，不僅讓這個地區蒙上一層神祕的色彩，更被烙上「魔鬼三角」的稱號…
    相傳，西班牙海軍裡有位治軍嚴明的薩拉查船長，他冷血凶狠的獵殺手段，讓海盜們聞風喪膽。這位橫行加勒比海的船長與他的鐵血海軍，在一個夜晚突然離奇消失，少了他在海上大力掃蕩，海盜們便肆無忌憚，日益猖獗，漸漸的，把這號人物遺忘。其實，薩拉查船長從沒離開過「魔鬼三角」，只是碰上他的船隻都沒好下場，沒人能活著出來證實罷了。
    這回，薩船長鐵了心，決定留一個活口，帶個口信給加勒比海最猖狂的海盜…`, {
      '0604': ['1000', '1100', '1200', '1300'],
      '0605': ['1007', '1120', '1200', '1300'],
      '0606': ['1008', '1145', '1200', '1300']},
    'https://www.in89pier2.com.tw/movie_img/bo2/377/377',
  'https://www.in89pier2.com.tw/movie_img/bo2/377/377_big',
  'https://www.youtube.com/embed/LldnSzk4uD4?rel=0&amp;showinfo=0'),
  movieFactory('為妳唱的歌', `上映日期：2017-05-26
    發行商：東昊影業有限公司
    語言：英語
    片長：129分
    級數：輔15級
    導演：泰倫斯馬力克
    演員：萊恩葛斯林、魯妮瑪拉、麥可法斯賓達、娜塔莉波曼、凱特布蘭琪、荷莉杭特`
    , `＊最後上映日：未定

    兩對戀人，一場音樂季，浪漫四角戀激情上演…

    菲(魯妮瑪拉飾)愛玩音樂，夢想成為創作歌手，談戀愛不受羈絆，她遇見了音樂人”BV”(萊恩葛斯林飾)，他深受菲著迷並與她展開熱戀。BV與放蕩不羈的王牌音樂製作人庫克(麥克法斯賓達飾)合作無間，兩人亦師亦友的和諧關係卻遭到庫克的無情背叛…。庫克與女服務生蘭妲(娜塔莉波曼飾)在餐廳邂逅，發展出天雷勾動地火的激情戀曲，同時蘭妲默默寄望著庫克能幫助她解決生計危機…。兩對戀人的愛情，交錯糾纏在這場充滿搖滾與迷幻氛圍的音樂季，他們愛得隨心所欲，卻同時也譜出心碎的序曲…`, {
      '0604': ['1000', '1100', '1200'],
      '0605': ['1007', '1120', '1200'],
      '0606': ['1008', '1145', '1200']},
    'https://www.in89pier2.com.tw/movie_img/bo2/383/383',
  'https://www.in89pier2.com.tw/movie_img/bo2/383/383_big',
  'https://www.youtube.com/embed/IQ5pjxQsTmM?rel=0&amp;showinfo=0')
]

function movieFactory (title, info, desc, date, img, cover, video) {
  return {
    title,
    info: info.replace(/(\r\n|\n|\r)/gm, '<br />'),
    desc,
    date,
    img,
    cover,
    video
  }
}

export function getData (n) {
  return movies[n] || {
    title: 'Unknow',
    desc: `not found movie`
  }
}

export function getAllData () {
  return movies
}
